ch32-riscv-ug/ArduinoCore-CH32/libraries/Wire/src/Wire.h
/* Wire (I2C) for CH32 RISC-V.
 *
 * Master mode, polled. The pins come from the variant's CH32_I2Cn_SCL/SDA, so
 * a sketch calls Wire.begin() with no arguments the way it does on AVR.
 *
 * Slave mode (begin(address), onReceive, onRequest) is interrupt-driven -
 * a slave cannot poll, because the master decides when to talk. The AVR
 * semantics are kept where libraries depend on them:
 *
 *   - onReceive(count) runs in interrupt context, after the stop condition,
 *     with the message readable through available()/read()
 *   - onRequest() runs in interrupt context at the address match; what it
 *     write()s is what the master reads
 *   - a master that reads more than onRequest() provided gets 0xFF, the
 *     bus's idle level, rather than a repeat of the last byte
 *   - a message longer than CH32_WIRE_BUFFER_SIZE keeps its head and drops
 *     the tail, as AVR's twi does
 *
 * One instance is a master or a slave, not both: begin() and begin(address)
 * choose, end() switches. Multi-master arbitration is not supported. General
 * call (address 0) is not answered.
 *
 * Every wait in the master driver is bounded. A missing pull-up or a device
 * holding SDA low is the normal I2C failure, and an unbounded wait would turn
 * that into a hung sketch instead of an endTransmission() error code.
 */
#pragma once

#include "api/HardwareI2C.h"
#include "ch32_pins.h"
#include "ch32_route.h"
#include "pins_arduino.h"

#include <stdint.h>

/* AVR's Wire uses 32, and libraries written against it assume a write of more
 * than 32 bytes is truncated rather than sent. Raise it per sketch with
 *   -DCH32_WIRE_BUFFER_SIZE=128
 * remembering that both buffers grow, on every Wire instance. */
#ifndef CH32_WIRE_BUFFER_SIZE
#define CH32_WIRE_BUFFER_SIZE 32
#endif

/* How long a single bus wait may take before the call gives up, in
 * microseconds. 25 ms is well past the worst case for a byte at the slowest
 * clock this driver programs, so hitting it means the bus is stuck. */
#ifndef CH32_WIRE_TIMEOUT_US
#define CH32_WIRE_TIMEOUT_US 25000UL
#endif

namespace arduino {

class CH32TwoWire : public HardwareI2C {
public:
    CH32TwoWire(uint32_t base, uint32_t clock_bit, uint8_t scl_pin,
                uint8_t sda_pin, uint32_t remap_mask, uint32_t remap_value,
                uint32_t remap2_mask, uint32_t remap2_value,
                uint8_t ev_irqn, uint8_t er_irqn)
        : _base(base), _clock_bit(clock_bit), _scl_pin(scl_pin),
          _sda_pin(sda_pin), _remap_mask(remap_mask),
          _remap_value(remap_value), _remap2_mask(remap2_mask),
          _remap2_value(remap2_value), _ev_irqn(ev_irqn),
          _er_irqn(er_irqn) {}

    void begin() override;
    void begin(uint8_t address) override;
    void end() override;

    void setClock(uint32_t freq) override;

    void beginTransmission(uint8_t address) override;
    uint8_t endTransmission(bool stopBit) override;
    uint8_t endTransmission(void) override { return endTransmission(true); }

    size_t requestFrom(uint8_t address, size_t len, bool stopBit) override;
    size_t requestFrom(uint8_t address, size_t len) override {
        return requestFrom(address, len, true);
    }

    void onReceive(void (*)(int)) override;
    void onRequest(void (*)(void)) override;

    /* Interrupt entry points, called by the I2Cn_EV/I2Cn_ER vectors in
     * Wire.cpp. Public for the same reason HardwareSerial::irq() is: the
     * vector is a free function and a friend declaration would only dress
     * that up. Not part of the sketch-facing API. */
    void ev_irq(void);
    void er_irq(void);

    /* Move this bus onto another of its pin routes.
     *
     * false, and nothing changed, when the route does not exist on this
     * series - and setPins() also refuses an SCL and an SDA that belong to
     * different routes, which the hardware cannot do. Several X035 routes
     * swap the two signals over the same pair of pads, so the order matters
     * and is checked.
     *
     * Calling either after begin() reopens the bus on the new pins and hands
     * the old pads back as inputs. */
    bool setRoute(uint8_t route);
    bool setPins(uint8_t scl, uint8_t sda);

    /* Print/Stream */
    size_t write(uint8_t data) override;
    size_t write(const uint8_t *data, size_t len) override;
    using Print::write;
    int available(void) override;
    int read(void) override;
    int peek(void) override;
    void flush(void) override {}

private:
    bool wait_flag1(uint16_t mask, bool set);
    bool use_route(const ch32_route_t &route);
    bool start(uint8_t address, bool read);
    void stop(void);
    void recover(void);

    const uint32_t _base;
    const uint32_t _clock_bit;
    /* Not const: setRoute()/setPins() move the bus between pin sets. */
    uint8_t _scl_pin;
    uint8_t _sda_pin;
    /* AFIO field that routes this I2C to _scl_pin/_sda_pin, written on every
     * begin() for the same reason HardwareSerial writes its own: going back to
     * the default pins has to be a real write, not an assumption. */
    const uint32_t _remap_mask;
    uint32_t _remap_value;
    const uint32_t _remap2_mask;
    uint32_t _remap2_value;

    const uint8_t _ev_irqn;
    const uint8_t _er_irqn;

    uint32_t _clock_hz = 100000;
    uint8_t _address = 0;          /* target of the transmission being built */
    bool _started = false;
    bool _transmitting = false;
    bool _tx_overflow = false;
    /* Set when a transfer ended badly, so the next one resets the peripheral
     * first: an aborted transfer can leave BUSY asserted forever. */
    bool _needs_recovery = false;

    /* Slave state. The callbacks run in interrupt context. _slave_replying
     * is what lets write() tell "inside onRequest()" apart from "outside any
     * transmission", where write() must go nowhere. */
    void (*_on_receive)(int) = nullptr;
    void (*_on_request)(void) = nullptr;
    volatile bool _slave = false;
    volatile bool _slave_replying = false;

    /* Shared by the polled master and the slave interrupt handler - never
     * both at once, since the modes are exclusive. Volatile for the halves
     * the handler writes while the sketch reads. */
    uint8_t _tx[CH32_WIRE_BUFFER_SIZE];
    volatile uint8_t _tx_len = 0;
    volatile uint8_t _tx_sent = 0;
    uint8_t _rx[CH32_WIRE_BUFFER_SIZE];
    volatile uint8_t _rx_len = 0;
    volatile uint8_t _rx_read = 0;
};

}  // namespace arduino

/* The bare name is the first bus and Wire1 the second, as elsewhere in the
 * Arduino ecosystem - see the note above the instances in Wire.cpp. */
#if defined(CH32_I2C1_SCL)
extern arduino::CH32TwoWire Wire;       /* I2C1 */
#if defined(CH32_I2C2_SCL)
extern arduino::CH32TwoWire Wire1;      /* I2C2 */
#endif
#elif defined(CH32_I2C2_SCL)
extern arduino::CH32TwoWire Wire;       /* I2C2, on a part that has no I2C1 */
#endif
